<?php
//.-----------------------------------------------------------------------------------
// |  Software: [ZHPHP framework]
// |   Version: 2014.06
// |-----------------------------------------------------------------------------------
// |    Author: 周鸿 <136871204@qq.com>
// | Copyright (c) 2014, 周鸿 <136871204@qq.com>.All Rights Reserved.
// |-----------------------------------------------------------------------------------
/**
 * 事件基类
 * @category ZHPHP
 * @package ZHPHP
 * @subpackage core
 * @author 周鸿 <136871204@qq.com>
 */
abstract class Event
{
    
}
